soa tp.postman_collection.json

{
	"info": {
		"_postman_id": "7b808d88-666b-4c56-b483-96df64b98c14",
		"name": "soa tp",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json"
	},
	"item": [
		{
			"name": "post wsdl multiplication",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap-env:Envelope\nxmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap-env:Header></soap-env:Header>\n<soap-env:Body xmlns:tns=\"http://tp1/\">\n<tns:add>\n<a>1</a>\n<b>20</b>\n</tns:add>\n</soap-env:Body>\n</soap-env:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8500/",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8500",
					"path": [
						""
					]
				}
			},
			"response": []
		},
		{
			"name": "post wsdl add",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap-env:Envelope\nxmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap-env:Header></soap-env:Header>\n<soap-env:Body xmlns:tns=\"http://tp1/\">\n<tns:add>\n<a>1</a>\n<b>20</b>\n</tns:add>\n</soap-env:Body>\n</soap-env:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8500/",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8500",
					"path": [
						""
					]
				}
			},
			"response": []
		},
		{
			"name": "post wsdl add user",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap-env:Envelope\nxmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap-env:Header></soap-env:Header>\n<soap-env:Body xmlns:tns=\"http://tp1/\">\n<tns:add>\n<a>1</a>\n<b>20</b>\n</tns:add>\n</soap-env:Body>\n</soap-env:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8500/",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8500",
					"path": [
						""
					]
				}
			},
			"response": []
		},
		{
			"name": "post wsdl sub",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap-env:Envelope\nxmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap-env:Header></soap-env:Header>\n<soap-env:Body xmlns:tns=\"http://tp1/\">\n<tns:subtract>\n<a>100</a>\n<b>20</b>\n</tns:subtract>\n</soap-env:Body>\n</soap-env:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8500/",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8500",
					"path": [
						""
					]
				}
			},
			"response": []
		},
		{
			"name": "post wsdl div",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<soap-env:Envelope\nxmlns:soap-env=\"http://schemas.xmlsoap.org/soap/envelope/\">\n<soap-env:Header></soap-env:Header>\n<soap-env:Body xmlns:tns=\"http://tp1/\">\n<tns:div>\n<a>1000</a>\n<b>25</b>\n</tns:div>\n</soap-env:Body>\n</soap-env:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "http://localhost:8500/",
					"protocol": "http",
					"host": [
						"localhost"
					],
					"port": "8500",
					"path": [
						""
					]
				}
			},
			"response": []
		}
	]
}